app/views/admin/items/_form.html.erb

					<td><%= f.label :genre_id, "ジャンル" %></td>
					<td class="select_field"><%= f.collection_select :genre_id, Genre.all, :id, :name %></td>
---
SELECT "genres".* FROM "genres"