app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "1"], ["created_at", "2022-05-28 11:19:00.026733"], ["updated_at", "2022-05-28 11:19:00.026733"]]
---
  def create
    @genre = Genre.new(genre_params)
    if @genre.save

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "is_active" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "11"], ["is_active", 0], ["updated_at", "2022-05-28 12:02:35.948216"], ["id", 1]]
---
  def update
    @genre = Genre.find(params[:id])
    if @genre.update(genre_params)