app/controllers/admin/items_controller.rb

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("genre_id", "name", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["genre_id", 1], ["name", "1"], ["introduction", "1"], ["price", 1], ["created_at", "2022-05-30 06:34:06.648051"], ["updated_at", "2022-05-30 06:34:06.648051"]]