app/controllers/admin/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
  def show
    @order = Order.find(params[:id])
    @order_details = @order.order_details.all

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 1], ["updated_at", "2022-06-02 02:14:00.536055"], ["id", 1]]
UPDATE "order_details" SET "making_status" = ? WHERE "order_details"."order_id" = ?  [["making_status", 1], ["order_id", 1]]
---
  def update
    @order = Order.find(params[:id])
    @order.update(order_params)
    if @order.status == "confirm_deposit"
      @order.order_details.update_all(making_status: 1)