app/controllers/admin/order_details_controller.rb

  def update
    @order = Order.find(params[:order_id])
    @order_detail = @order.order_details.find(params[:id])
    @order_detail.update(order_detail_params)
    if @order_detail.making_status == "in_production"
      @order.update(status: 2)
    elsif @order.order_details.completed.count == @order.order_details.count
      @order.update(status: 3)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ? AND "order_details"."id" = ? LIMIT ?  [["order_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 2], ["updated_at", "2022-06-02 02:38:45.393281"], ["id", 1]]
UPDATE "order_details" SET "making_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["making_status", 0], ["updated_at", "2022-06-02 02:33:48.229771"], ["id", 1]]
SELECT COUNT(*) FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 3], ["updated_at", "2022-06-02 02:39:07.041808"], ["id", 1]]