app/views/admin/orders/index.html.erb

					<td><%= order.customer.full_name %></td>
					<td><%= order.order_details.sum(:amount) %></td>
---
SELECT "orders".* FROM "orders"
SELECT SUM("order_details"."amount") FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]