app/controllers/public/addresses_controller.rb

SELECT "addresses".* FROM "addresses"
---
  def index
    @address = Address.new
    @addresses = Address.all

INSERT INTO "addresses" ("customer_id", "postal_code", "destination", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 3], ["postal_code", "1"], ["destination", ""], ["name", "1"], ["created_at", "2022-05-30 10:15:53.965188"], ["updated_at", "2022-05-30 10:15:53.965188"]]
---
  def create
    @addresses = Address.all
    # @address = @addresses.new(address_params)
    # こう書くと、save出来なかった時に、@addressesの最後に空レコードが入り、エラーになる。
    @address = Address.new(address_params)
    @address.customer_id = current_customer.id
    if @address.save

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "destination" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["destination", "1"], ["updated_at", "2022-05-30 10:18:48.889468"], ["id", 1]]
---
  def update
    @address = Address.find(params[:id])
    if @address.update(address_params)

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]
---
  def destroy
    @address = Address.find(params[:id])
    @address.destroy