app/controllers/public/cart_items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 3], ["item_id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "updated_at" = ?, "amount" = ? WHERE "cart_items"."id" = ?  [["updated_at", "2022-05-30 09:57:41.405495"], ["amount", 2], ["id", 6]]
UPDATE "cart_items" SET "updated_at" = ?, "amount" = ? WHERE "cart_items"."id" = ?  [["updated_at", "2022-05-30 09:32:34.655300"], ["amount", 2], ["id", 1]]
INSERT INTO "cart_items" ("created_at", "updated_at", "customer_id", "item_id", "amount") VALUES (?, ?, ?, ?, ?)  [["created_at", "2022-06-02 02:44:25.879259"], ["updated_at", "2022-06-02 02:44:25.879259"], ["customer_id", 3], ["item_id", 1], ["amount", 1]]
---
  def create
    @item = Item.find(params[:item_id])
    @cart_item = current_customer.cart_items.find_by(item_id: @item.id)
    if @cart_item.present?
      new_amount = @cart_item.amount + cart_item_params[:amount].to_i
      @cart_item.update(amount: new_amount)
      redirect_to cart_items_path
    else
      @cart_item = current_customer.cart_items.new(cart_item_params)
      @cart_item.item_id = @item.id
      if @cart_item.save

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 3], ["item_id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "updated_at" = ?, "amount" = ? WHERE "cart_items"."id" = ?  [["updated_at", "2022-06-02 02:44:38.457675"], ["amount", 8], ["id", 8]]
---
  def update
    @item = Item.find(params[:item_id])
    @cart_item = current_customer.cart_items.find_by(item_id: @item.id)
    @cart_item.update(cart_item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 3], ["item_id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 2]]
---
  def destroy
    @item = Item.find(params[:item_id])
    @cart_item = current_customer.cart_items.find_by(item_id: @item.id)
    @cart_item.destroy

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 13]]
---
  def destroy_all
    CartItem.destroy_all