app/controllers/public/customers_controller.rb

  def update
    if @customer = Customer.update(customer_params)
---
UPDATE "customers" SET "email" = ?, "first_name" = ?, "last_name" = ?, "first_name_kana" = ?, "last_name_kana" = ?, "postal_code" = ?, "address" = ?, "telephone_number" = ?, "updated_at" = ? WHERE "customers"."id" = ?

  def withdraw
    @customer = current_customer
    @customer = Customer.update(is_active: false)
---
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 0], ["updated_at", "2022-05-28 09:17:30.819321"], ["id", 1]]