app/controllers/public/orders_controller.rb

SELECT "cart_items".* FROM "cart_items"
SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ? AND "addresses"."id" = ? LIMIT ?  [["customer_id", 3], ["id", 4], ["LIMIT", 1]]
---
  def confirm
    @cart_items = CartItem.all
    @order = Order.new(order_params)
    if params[:order][:select_address] == '0'
      @order.postal_code = current_customer.postal_code
      @order.destination = current_customer.address
      @order.name = current_customer.full_name
    elsif params[:order][:select_address] == '1'
      @address = current_customer.addresses.find(params[:order][:address_id])

SELECT "cart_items".* FROM "cart_items"
INSERT INTO "orders" ("customer_id", "postal_code", "destination", "name", "shipping_cost", "grand_total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 3]]
INSERT INTO "order_details" ("order_id", "item_id", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 2], ["item_id", 1], ["price", 16], ["amount", 8], ["created_at", "2022-06-02 02:49:22.762958"], ["updated_at", "2022-06-02 02:49:22.762958"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 8]]
---
  def create
    @order = current_customer.orders.new(order_params)
    @order.shipping_cost = 800
    @cart_items = CartItem.all
    @sum = 0

    @cart_items.each do |cart_item|
      @sum += cart_item.subtotal
		end

    @order.grand_total = @order.shipping_cost + @sum.to_i

    if @order.save
      current_customer.cart_items.each do |cart_item| #注文詳細モデルに注文商品を保存
        @order_detail = OrderDetail.new
        @order_detail.order_id = @order.id
        @order_detail.item_id = cart_item.item_id
        @order_detail.price = cart_item.item.with_tax_price
        @order_detail.amount = cart_item.amount
        @order_detail.save
      end
      current_customer.cart_items.destroy_all