app/controllers/public/sessions_controller.rb

  def configure_sign_in_params
    ## 【処理内容1】 入力されたemailからアカウントを1件取得
    @customer = Customer.find_by(email: params[:customer][:email])
---
SELECT "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "a@a"], ["LIMIT", 1]]