app/views/public/orders/index.html.erb

					<td>
						<% order.items.each do |item| %>
---
SELECT "items".* FROM "items" INNER JOIN "order_details" ON "items"."id" = "order_details"."item_id" WHERE "order_details"."order_id" = ?  [["order_id", 1]]