app/views/public/orders/new.html.erb

			<label class="fz16"><%= f.radio_button :select_address, 1 %>登録済住所から選択</label>
			<%= f.select "address_id", options_from_collection_for_select(current_customer.addresses, :id, :finally_address), prompt: "住所を選択してください" %>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?  [["customer_id", 3]]