app/views/public/orders/show.html.erb

			  <% @sum = 0 %>
				<% @order.order_details.includes(:item).each do |order_detail| %>
---
SELECT "items".* FROM "items" WHERE "items"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 5]]